artilleryStress.yml
config:
  target: 'https://blazedemo.com/index.php'
  engines:
    playwright:
      launchOptions:
        headless: true
      contextOptions:
        # Set default timeouts for all Playwright operations
        timeout: 60000  # 60 seconds for navigation and actions
  # Combined processor with multiple scenarios
  processor: './tests/artillery/processor.js'
  # Enable intermediate reporting for per-period metrics
  ensure:
    intermediate: true
  # Report metrics every 10 seconds
  statsInterval: 10
  phases:
  # 1️ Warm-up (baseline)
  - name: warmup
    duration: 30
    arrivalRate: 2

  # 2️ Ramp-up to heavy load
  - name: ramp_up
    duration: 60
    arrivalRate: 2
    rampTo: 25

  # 3️ Stress phase — keep pushing
  - name: stress_increase
    duration: 60
    arrivalRate: 25
    rampTo: 50   # gradually double load

  # 4️ Overload — push system to limits
  - name: overload
    duration: 30
    arrivalRate: 50

  # 5️ Cooldown
  - name: recovery
    duration: 60
    arrivalRate: 2

scenarios:
  # ============================================================================
  # SCENARIO 1: Original Test (uses helper functions)
  # ============================================================================
  - name: testScenario
    engine: 'playwright'
    flowFunction: 'artilleryScript'
    weight: 1  # Equal weight distribution
  
  # ============================================================================
  # SCENARIO 2: Comprehensive Flight Search Performance Test
  # ============================================================================
  - name: flightSearchPerformance
    engine: 'playwright'
    flowFunction: 'flightSearchPerformance'
    weight: 1  # Equal weight distribution
  
  # ============================================================================
  # SCENARIO 3: Vacation Page Load Performance Test
  # ============================================================================
  - name: vacationPagePerformance
    engine: 'playwright'
    flowFunction: 'vacationPagePerformance'
    weight: 1  # Equal weight distribution