artillery_copy.yml
config:
  target: "https://www.demoblaze.com/index.html"
  engines:
    playwright:
      launchOptions:
        headless: true
      contextOptions:
        timeout: 60000
  # Processor for webstore performance test
  processor: "./tests/artillery/webstorePerformance.js"
  # Enable intermediate reporting for per-period metrics
  # ensure:
  #   intermediate: true
  # Report metrics every 10 seconds
  statsInterval: 10
  phases:
    #pause
    - name: pause
      duration: 10
      arrivalRate: 0
    #ramp up
    - name: rampUp
      duration: 10
      arrivalRate: 1
      rampTo: 5
    #hold at steady state for 2 minutes
    - name: steadyState
      duration: 20
      arrivalRate: 5
    #ramp down
    - name: rampDown
      duration: 10
      arrivalRate: 5
      rampTo:
        0
    #final pause
    - name: finalPause
      duration: 10
      arrivalRate: 0
scenarios:
  # ============================================================================
  # SCENARIO: Webstore Purchase Performance Test
  # ============================================================================
  - name: webstorePurchasePerformance
    engine: "playwright"
    flowFunction: "webstorePurchasePerformance"
    custom:
      testName: "Webstore Performance Test"