artillery_copy.yml
config:
  target: 'https://www.demoblaze.com/index.html'
  engines:
    playwright:
      launchOptions:
        headless: true
      contextOptions:
        timeout: 60000
  # Processor for webstore performance test
  processor: './tests/artillery/webstorePerformance.js'
  # Enable intermediate reporting for per-period metrics
  ensure:
    intermediate: true
  # Report metrics every 10 seconds
  statsInterval: 10
  phases:
    #ramp up
    - name : rampUp
      duration: 10
      arrivalRate: 2  
      rampTo: 10
      #minnysoak
    - name: steadyState
      duration: 60
      arrivalRate: 10
scenarios:
  # ============================================================================
  # SCENARIO: Webstore Purchase Performance Test
  # ============================================================================
  - name: webstorePurchasePerformance
    engine: 'playwright'
    flowFunction: 'webstorePurchasePerformance'